# 변수와 데이터

# 변수란?
# 데이터 저장소이다.
# 변수는 항상 값을 갖는다.
# 그 값을 데이터라고 부른다.

# 변수는 또 변하는 정보로 볼 수 있다.
# message = 'hello'
# print(message)

# 변수작성에는 몇가지 규칙이 있다.
# 1) 문자와 숫자를 사용하여 변수를 작성할 수 있다. 단, 숫자를 앞에 작성할 수 없다.
# 2) 띄어쓰기를 할 때는 언더바를 이용하여 작성해야 한다.
# 3) 파이썬의 예약어를 사용하여 변수를 작성할 수 없다.
# 4) 변수는 알아볼 수 있게 작성해야 한다.

# 데이터타입
# 데이터타입에는 문자열과 숫자가 있다.
# 문자작성에는 규칙이 있다.
# 따옴표와 쌍따옴표를 사용하여 문자열임을 나타낸다.
# 따옴표와 쌍따옴표는 같은 의미를 지닌다. 그러나 문자로서 따옴표를 작성해야하는 상황이 생긴다.

# 대문자와 소문자로 바꿀 수 있는 메서드가 있다.
# 메서드란 함수이며 변수에 어떠한 값을 부여할 수 있다.
# 변수 뒤에 .은 메서드를 부여하라는 명령을 내리는것과 같다.

# title() # 앞글자만 대문자로 바꿔준다.
# upper() # 모두 대문자로 바꿔준다.
# lower() # 모두 소문자로 바꿔준다.

# 공백문자 
# print('\thello') #탭으로 띄어쓰기
# print('\nhello') #줄내림


# 문자의 공백을 제거할 수 있다.
# lstrip() # 좌측공백 제거
# rstrip() # 우측공백 제거
# strip() # 좌우공백 제거

# 문자는 문자열과 변수, 문자열끼리, 변수끼리 더할 수 있다.

# 숫자
# 숫자로 사칙연산이 가능하다.
# 숫자로 제곱연산이 가능하다.
# 숫자계산에는 우선순위가 있다. 괄호를 사용하여 우선순위를 부여한다.
# 숫자와 문자를 결합할 때 에러가 뜬다.
# str()

#주석

#파이썬의 선
 